import matplotlib.pyplot as plt


x_year = [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019]
y_total = [41406, 40898, 40893, 40528, 40829, 40460, 40312, 40198, 40244, 40596, 41169, 41735]
y_arabs = [5900, 6300, 6800, 7200, 7800, 8300, 8700, 9300, 9900, 10500, 11100, 11979]
y_jews = [30400, 29500, 28900, 28000, 27500, 26700, 26000, 25200, 24600, 24100, 23848, 23296]
y_jews_and_others = [35500, 34500, 34100, 33400, 33000, 32200, 31600, 30900, 30400, 30100, 30069, 29756]

plt.plot(x_year, y_total)

plt.plot(x_year, y_jews_and_others)
plt.plot(x_year, y_jews)
plt.plot(x_year, y_arabs)


plt.legend(['םיבשות ךס', 'םירחאו םידוהי', 'םידוהי', 'םיברע'])

plt.xlabel('םינש')
plt.ylabel('םיבשות')

plt.savefig("civil_data.png")
